# EndsNotOnEdge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..EndsNotOnEdge Property
BuiltInFailures..::..SketchFailures Class See Also
---
Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EndsNotOnEdge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EndsNotOnEdge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EndsNotOnEdge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace